#!/usr/bin python
# -*- coding:utf-8 -*-


headList1 = ['今天','今早','早上','上午','中午','今晚','晚上','下晚','明天',
            '明早','明晚','明儿','明儿早','明儿晚','后天','外后','大后天',
            '下周','下星期','下礼拜','下晚','下周一','下周二','下周三',
            '下周四','下周五','下周六','下周日','下月','目前']
tailList1 = ['已','木有','有','没','满']
tailList1_0 = ['已','木有','没','满']
tailList1_1 = ['有']

headList2 = ['不','可以','能','还','不能']
tailList2 = ['短租','租','出租','接','接单','接待','招待']

headList3 = ['房','房子','房间','暂','暂时']

headList4 = ['1号','2号','3号','4号','5号','6号','7号','8号','9号','10号','11号','12号','13号','14号','15号',
             '16号','17号','18号','19号','20号','21号','22号','23号','24号','25号','26号','27号','28号','29号',
             '30号','31号']
headList4_02 = ['今天','明天','后天','外后','大后天','明儿','下周一','下周二','下周三','下周四','下周五','下周六','下周日']
tailList4 = ['早上','中午','下午','晚上']


headList = headList4_02
tailList = tailList4
reList = []
for head in headList:
    for tail in tailList:
        reList.append(head + tail)

for item in reList:
    print(item)




